Repository: srdjankokot/pausal
Catalog: lib/l10n/app_*.arb
Languages: sr

# appTitle
source: Tax Calculator
sr: Paušal kalkulator

source: Save
sr: Sačuvaj

source: Save Changes
sr: Sačuvaj promene

source: Save Item
sr: Sačuvaj stavku

source: Cancel
sr: Otkaži

source: Delete
sr: Obriši

source: Edit
sr: Uredi

source: Connect
sr: Poveži

source: Disconnect
sr: Prekini vezu

# loading
source: Connecting...
sr: Povezivanje...

# landingTitle
source: Tax Calculator
sr: Paušal kalkulator

# landingSubtitle
source: Digital assistant for flat-rate taxpayers developed by Finaccons.
sr: Digitalni asistent za paušalno oporezovane preduzetnike koji razvija Finaccons.

# launchApp
source: Launch Application
sr: Pokreni aplikaciju

# whatAppDoes
source: What the app does
sr: Šta aplikacija radi

# featureOverviewTitle
source: Business Overview
sr: Pregled poslovanja

# featureOverviewDesc
source: Automatically calculates revenue, expenses, net income and tax obligations under flat-rate taxation.
sr: Automatski izračunava promet, troškove, neto prihod i poreske obaveze po osnovu paušalnog oporezivanja.

# featureClientsTitle
source: Client Management
sr: Upravljanje klijentima

# featureClientsDesc
source: Track income by client, record contracts and keep track of prescribed limits.
sr: Pratite prihod po klijentu, evidentirajte ugovore i vodite računa o propisanim limitima.

# featureInvoicingTitle
source: Invoicing
sr: Fakturisanje

# featureInvoicingDesc
source: Create PDF invoices in accordance with local regulations and share them directly from the app.
sr: Kreirajte PDF fakture u skladu sa lokalnim propisima i delite ih direktno iz aplikacije.

source: What's new
sr: Šta je novo

# featureSyncTitle
source: Google Sheets synchronization
sr: Google Sheets sinhronizacija

# featureSyncDesc
source: Data connects directly to your Google Sheets document – the app reads and updates the same file without a manual export/import process.
sr: Podaci se povezuju direktno sa vašim Google Sheets dokumentom – aplikacija čita i ažurira isti fajl bez manualnog export/import procesa.

# featureOnboardingTitle
source: Simple onboarding
sr: Jednostavan onboarding

# featureOnboardingDesc
source: Connect an existing sheet or create a new document with all necessary sheets: expenses, clients and company profile.
sr: Povežite postojeći sheet ili kreirajte novi dokument sa svim potrebnim listovima: troškovi, klijenti i profil firme.

# featureDataControlTitle
source: Complete data control
sr: Potpuna kontrola podataka

# featureDataControlDesc
source: Data remains in your Google account. The app only uses permissions you explicitly granted.
sr: Podaci ostaju u vašem Google nalogu. Aplikacija koristi samo one dozvole koje ste eksplicitno odobrili.

source: Important links
sr: Važni linkovi

# linkPrivacyTitle
source: Privacy Policy
sr: Politika privatnosti

# linkPrivacyDesc
source: Explains in detail which Google accounts and Sheets permissions we use and why.
sr: Detaljno objašnjava koje Google naloge i Sheets dozvole koristimo i zašto.

# linkSupportTitle
source: Contact Support
sr: Kontakt podrška

# linkSupportDesc
source: Email pausal@finaccons.rs for help with setup or bug reports.
sr: Pišite na pausal@finaccons.rs za pomoć u podešavanju ili prijavu grešaka.

# linkRoadmapTitle
source: Development Plan
sr: Plan razvoja

# linkRoadmapDesc
source: Adding client analytics, XML/JPKD format export and much more.
sr: Dodavanje analitike po klijentu, eksport u XML/JPKD format i još mnogo toga.

# privacyPolicyTitle
source: Privacy Policy
sr: Politika privatnosti

# privacyPolicyFullTitle
source: Privacy Policy – Tax Calculator
sr: Politika privatnosti – Paušal kalkulator

# privacyIntro
source: This privacy policy explains how Tax Calculator uses and protects data when a user logs in via a Google account and connects their Google Sheets document for calculations and business tracking.
sr: Ova politika privatnosti objašnjava kako Paušal kalkulator koristi i štiti podatke kada se korisnik prijavi putem Google naloga i poveže svoj Google Sheets dokument radi obračuna i praćenja poslovanja.

# privacySectionDataAccess
source: Data we access
sr: Podaci kojima pristupamo

# privacyGoogleAccountTitle
source: Google account (openid)
sr: Google nalog (openid)

# privacyGoogleAccountDesc
source: We use the "openid" permission to securely log you into the app and connect your account with a unique identifier we receive from Google. We do not use or store your email address for application purposes.
sr: Koristimo "openid" dozvolu kako bismo vas bezbedno prijavili u aplikaciju i povezali vaš nalog sa jedinstvenim identifikatorom koji dobijamo od Google-a. Ne koristimo i ne čuvamo vašu e-mail adresu za potrebe aplikacije.

# privacyGoogleSheetsTitle
source: Google Sheets file you select
sr: Google Sheets fajl koji izaberete

# privacyGoogleSheetsDesc
source: The app uses Google Picker and "drive.file" permission to allow you to manually select a specific Google Sheets file. After that, Tax Calculator uses the Google Sheets API to read cell values, add new rows, update specific ranges and clear ranges exclusively in that document (e.g. income, expenses, clients). The app has no access to other documents in your Google account.
sr: Aplikacija koristi Google Picker i "drive.file" dozvolu kako bi vam omogućila da ručno izaberete konkretan Google Sheets fajl. Nakon toga Paušal kalkulator koristi Google Sheets API kako bi čitao vrednosti ćelija, dodavao nove redove, ažurirao određene opsege i čistio opsege isključivo u tom dokumentu (npr. prihodi, troškovi, klijenti). Aplikacija nema pristup drugim dokumentima na vašem Google nalogu.

# privacySectionScopes
source: Google API permissions (scopes)
sr: Google API dozvole (scopes)

# privacyScopesDetails
source: Tax Calculator uses the following Google API permissions that are necessary for the app to work: • openid – for secure user login. • https://www.googleapis.com/auth/spreadsheets – for reading and updating Google Sheets document content (reading ranges, adding rows, updating and deleting cell ranges). • https://www.googleapis.com/auth/drive.file – for selecting a specific file on Google Drive via Google Picker. We do not use "email" permissions or other sensitive or restricted Google API permissions that are not necessary for the application to function. We limit access exclusively to the document that the user manually selects and to the ranges that the app updates for data calculations.
sr: Paušal kalkulator koristi sledeće Google API dozvole koje su neophodne za rad aplikacije: • openid – za bezbednu prijavu korisnika. • https://www.googleapis.com/auth/spreadsheets – za čitanje i ažuriranje sadržaja Google Sheets dokumenta (čitanje opsega, dodavanje redova, ažuriranje i brisanje opsega ćelija). • https://www.googleapis.com/auth/drive.file – za izbor konkretnog fajla na Google Drive-u putem Google Picker-a. Ne koristimo dozvole "email" niti druge osetljive ili ograničene Google API dozvole koje nisu neophodne za funkcionisanje aplikacije. Pristup ograničavamo isključivo na dokument koji korisnik ručno odabere i na opsege koje aplikacija ažurira radi obračuna podataka.

# privacySectionDataUse
source: How we use data
sr: Kako koristimo podatke

# privacyDataUseDetails
source: We use access to the Google account and selected Google Sheets document exclusively to: • enable login to the app, • read data from the selected Sheets file for calculations and display in the app, • write new entries, add rows, clear specific ranges and update only necessary parts of the document for up-to-date record keeping. We do not use your Google data for advertising, marketing or creating user profiles. We do not sell or rent your data to third parties and do not use data from Google Drive/Sheets files to train general AI/ML models.
sr: Pristup Google nalogu i odabranom Google Sheets dokumentu koristimo isključivo da bismo: • omogućili prijavu u aplikaciju, • pročitali podatke iz odabranog Sheets fajla radi obračuna i prikaza u aplikaciji, • upisali nove unose, dodali redove, očistili određene opsege i ažurirali samo potrebne delove dokumenta radi ažurnog vođenja evidencije. Ne koristimo vaše Google podatke za oglašavanje, marketing ili pravljenje korisničkih profila. Ne prodajemo i ne iznajmljujemo vaše podatke trećim stranama i ne koristimo podatke iz Google Drive/Sheets fajlova za obučavanje opštih AI/ML modela.

# privacySectionDataProtection
source: Storage, protection and sharing of data
sr: Čuvanje, zaštita i deljenje podataka

# privacyDataProtectionDetails
source: The content of your Google Sheets documents remains within your Google account. The app reads this data "on demand" and, if necessary, caches it briefly for performance. Such data is stored for the shortest possible time and is protected by appropriate technical measures (HTTPS/TLS, access control, etc.). We do not share data with third parties except with trusted technical providers (e.g. hosting), and only to the extent necessary for the app to work, with a contractual obligation to protect data.
sr: Sadržaj vaših Google Sheets dokumenata ostaje u okviru vašeg Google naloga. Aplikacija te podatke čita "na zahtev" i, po potrebi, kratkotrajno kešira radi performansi. Takvi podaci se čuvaju najkraće moguće vreme i zaštićeni su odgovarajućim tehničkim merama (HTTPS/TLS, kontrola pristupa itd.). Podatke ne delimo sa trećim stranama osim sa pouzdanim tehničkim provajderima (npr. hosting), i to isključivo u meri u kojoj je neophodno za rad aplikacije, uz ugovornu obavezu zaštite podataka.

# privacySectionUserRights
source: Your rights and data deletion
sr: Vaša prava i brisanje podataka

# privacyUserRightsDetails
source: You can revoke app access at any time via your Google account page: https://myaccount.google.com/permissions You can also contact us if you want us to delete data stored within the app itself (e.g. local configurations). After identity verification, we will delete or anonymize the data, except for data we are legally required to retain (e.g. accounting records).
sr: Pristup aplikaciji možete opozvati u bilo kom trenutku preko stranice vašeg Google naloga: https://myaccount.google.com/permissions Takođe, možete nam se obratiti ukoliko želite da obrišemo podatke koji se čuvaju u okviru same aplikacije (npr. lokalne konfiguracije). Nakon potvrde identiteta, obrišaćemo ili anonimizovati podatke, osim onih koje smo zakonski obavezni da zadržimo (npr. knjigovodstvena evidencija).

# privacySectionContact
source: Questions and contact
sr: Pitanja i kontakt

# privacyContactDetails
source: If you have questions about the privacy policy or how the app processes data, you can contact us at:
sr: Ako imate pitanja u vezi sa politikom privatnosti ili načinom na koji aplikacija obrađuje podatke, možete nas kontaktirati na:

# privacyLastUpdated
source: Last updated: 14.11.2025.
sr: Poslednje ažuriranje: 14.11.2025.

# navOverview
source: Overview
sr: Pregled

# navLedger
source: Ledger
sr: Knjiga

# navClients
source: Clients
sr: Klijenti

# navProfile
source: Profile
sr: Profil

# googleSheetsSync
source: Google Sheets synchronization
sr: Google Sheets sinhronizacija

source: Connect Google Sheets
sr: Poveži Google Sheets

# connectSheetHeading
source: Connect Google Sheets account
sr: Povežite Google Sheets nalog

# connectSheetDescription
source: To enter invoices, expenses and clients, you need to connect your Google Sheets document.
sr: Za unos faktura, troškova i klijenata potrebno je da povežete svoj Google Sheets dokument.

# connectSheetPlaceholder
source: Connect to a Google Sheets account to save company and tax data.
sr: Povežite se sa Google Sheets nalogom da biste čuvali podatke o firmi i porezima.

# connectBeforeData
source: Connect Google Sheets before adding data.
sr: Povežite Google Sheets pre nego što dodate podatke.

source: Connected as
sr: Povezano kao

source: Google account
sr: Google nalog

# dataSavedInSheets
source: Data is saved directly in the Google Sheet. Connect to create entries.
sr: Podaci se čuvaju direktno u Google Sheet-u. Povežite se kako biste mogli da kreirate stavke.

# connectDialogTitle
source: Connecting to Google Sheet
sr: Povezivanje sa Google Sheet-om

# createNewSheet
source: Create new Google Sheet
sr: Kreiraj novi Google Sheet

# createNewSheetSubtitle
source: The app will automatically create the document and worksheets.
sr: Aplikacija će automatski kreirati dokument i radne listove.

source: Document name
sr: Naziv dokumenta

# documentNameHint
source: Tax Calculator
sr: Paušal kalkulator

source: Enter document name
sr: Unesite naziv dokumenta

source: Google Sheet document
sr: Google Sheet dokument

# selectGoogleSheetDocument
source: Select Google Sheets document
sr: Izaberite Google Sheets dokument

# clickToSelectDocument
source: Click the icon on the right to select a document.
sr: Kliknite na ikonu desno kako biste izabrali dokument.

# selectFromDrive
source: Select from Google Drive
sr: Izaberi iz Google Drive-a

source: Spreadsheet URL or ID
sr: Spreadsheet URL ili ID

# spreadsheetUrlHint
source: https://docs.google.com/... or 1A2B3C...
sr: https://docs.google.com/... ili 1A2B3C...

# enterFullUrlOrId
source: Enter full URL or ID of Google Sheets document
sr: Unesite pun URL ili ID Google Sheets dokumenta

source: Sheet for expenses
sr: Sheet za troškove

source: Sheet for clients
sr: Sheet za klijente

source: Sheet for profile
sr: Sheet za profil

# checkingStructure
source: Checking table structure...
sr: Proveravamo strukturu tabele...

# checkingSheetStructure
source: Checking structure of sheet {sheetName}
sr: Proveravamo strukturu sheet-a {sheetName}

source: Structure confirmed
sr: Struktura potvrđena

source: Loading invoices...
sr: Učitavamo fakture...

source: Loading clients...
sr: Učitavamo klijente...

source: Loading profile...
sr: Učitavamo profil...

# syncCompleted
source: Synchronization completed
sr: Sinhronizacija završena

# syncingWithSheets
source: Synchronizing with Google Sheets...
sr: Sinhronizacija sa Google Sheets...

# checkingSheetsHeaders
source: Checking worksheets and headers...
sr: Proveravamo radne listove i zaglavlja...

# loadingData
source: Data is being loaded.
sr: U toku je učitavanje podataka.

# savingToSheets
source: Saving data to Google Sheets…
sr: Snimam podatke u Google Sheets…

# waitForSync
source: Please wait for synchronization to complete.
sr: Molimo sačekajte dok se sinhronizacija ne završi.

# sessionExpired
source: Session expired. Please log in again to continue.
sr: Sesija je istekla. Prijavite se ponovo da biste nastavili.

# authError
source: Error authenticating Google account.
sr: Greška pri autentifikaciji Google naloga.

# pickerApiKeyNotConfigured
source: Google Picker API key not configured.
sr: Google Picker API ključ nije konfigurisan.

# pickerLoadError
source: Unable to load Google Picker. Please try again.
sr: Nije moguće učitati Google Picker. Pokušajte ponovo.

# syncFailed
source: Google Sheets synchronization failed.
sr: Neuspešna sinhronizacija sa Google Sheets.

# autoConnectFailed
source: Automatic Google Sheets account connection failed.
sr: Automatsko povezivanje Google Sheets naloga nije uspelo.

# connectFailed
source: Failed to connect to Google Sheets.
sr: Neuspešno povezivanje sa Google Sheets.

# sheetCreatedSuccess
source: New Google Sheet created ({spreadsheetId}).
sr: Kreiran je novi Google Sheet ({spreadsheetId}).

# sheetConnectedSuccess
source: Google Sheets synchronization activated ({spreadsheetId}).
sr: Google Sheets sinhronizacija aktivirana ({spreadsheetId}).

# selected
source: Selected: {name}
sr: Odabrano: {name}

# overviewGreeting
source: Hello, taxpayer!
sr: Dobrodošao, paušalac

# overviewSubtitle
source: Tracking income, expenses and flat-rate tax limits.
sr: Praćenje prihoda, troškova i limita paušalnog oporezivanja.

source: Total
sr: Ukupno

source: Issued invoices
sr: Izdati računi

source: Expenses
sr: Troškovi

source: Tax obligations
sr: Obaveze paušala

source: Estimated net
sr: Procenjeni neto

# revenueShareByClientYear
source: Revenue share by client in {year}
sr: Udeo prihoda po klijentima u {year}. godini

# noConnectedClients
source: No connected clients yet.
sr: Još uvek nema povezanih klijenata.

# clientLimitWarning
source: Make sure no single client exceeds 60% of total revenue.
sr: Pazite da pojedinačan klijent ne premaši 60% ukupnih prihoda.

# rollingLimit
source: Limit in the last 12 months
sr: Limit u poslednjih 12 meseci

source: Remaining to limit
sr: Preostalo do limita

# rollingLimitCap
source: 12-month limit
sr: Ograničenje 12m

# periodCovered
source: Period covered: {start} - {end}
sr: Obuhvaćen period: {start} - {end}

source: Annual limit
sr: Godišnji limit

source: Total limit
sr: Ukupan limit

source: Monthly obligations
sr: Mesečne obaveze

source: Pension contribution
sr: PIO doprinos

source: Health insurance
sr: Zdravstveno osiguranje

source: Tax prepayment
sr: Akontacija poreza

source: Total monthly
sr: Ukupno mesečno

source: Recent activity
sr: Poslednje aktivnosti

# noEntriesYet
source: No entries recorded yet.
sr: Još uvek nema zabeleženih stavki.

source: Unknown client
sr: Nepoznat klijent

source: Filters
sr: Filteri

source: Clear filters
sr: Obriši filtere

source: Year
sr: Godina

source: All years
sr: Sve godine

source: Month
sr: Mesec

source: All months
sr: Svi meseci

source: Client
sr: Klijent

source: All clients
sr: Svi klijenti

# invoices
source: Issued invoices
sr: Izdati računi

# noDataYet
source: No data yet. Add a new entry.
sr: Još uvek nema podataka. Dodajte novu stavku.

source: Clients
sr: Klijenti

source: New Client
sr: Novi klijent

# clientLimitNote
source: Make sure no client exceeds 60% of total revenue.
sr: Vodite računa da nijedan klijent ne premaši 60% ukupnih prihoda.

source: No clients yet.
sr: Još uvek nema klijenata.

source: Add first client
sr: Dodaj prvog klijenta

# pibLabel
source: Tax ID:
sr: PIB:

# clientStats
source: Share: {percent}% · Invoices: {invoiceCount} · {amount}
sr: Udeo: {percent}% · Računi: {invoiceCount} · {amount}

# profileHeading
source: Tax Profile
sr: Paušal profil

# profileHelperText
source: Update company and tax data. Company data appears on generated invoices.
sr: Ažurirajte podatke o firmi i paušalu. Podaci o firmi se pojavljuju na generisanim fakturama.

source: Company data
sr: Podaci o firmi

source: Company name
sr: Naziv firme

# companyShortName
source: Short name (optional)
sr: Skraćeni naziv (opciono)

source: Responsible person
sr: Odgovorno lice

# pib
source: Tax ID
sr: PIB

source: Address
sr: Adresa

source: Account number
sr: Broj računa

source: Tax data
sr: Poreski podaci paušala

source: City
sr: Grad

# monthlyPension
source: Pension contribution (monthly)
sr: PIO doprinos (mesečno)

# monthlyHealth
source: Health insurance (monthly)
sr: Zdravstveno osiguranje (mesečno)

# monthlyTaxPrepayment
source: Tax prepayment (monthly)
sr: Akontacija poreza (mesečno)

# annualLimitLabel
source: Annual income limit
sr: Godišnji limit prihoda

# rollingLimitLabel
source: Limit in the last 12 months
sr: Limit u poslednjih 12 meseci

# additionalTaxRate
source: Additional tax (in %)
sr: Dodatni porez (u %)

source: Data saved
sr: Podaci sačuvani

source: Edit Entry
sr: Izmena stavke

source: New Entry
sr: Nova stavka

source: Income
sr: Prihod

source: Expense
sr: Trošak

source: Invoice number
sr: Broj fakture

# invoiceNumberHint
source: e.g. 10-2025
sr: npr. 10-2025

source: Enter invoice number
sr: Unesite broj fakture

source: Invoice description
sr: Opis fakture

source: Expense name
sr: Naziv troška

source: Enter name
sr: Unesite naziv

source: Invoice items
sr: Stavke fakture

source: Add item
sr: Dodaj stavku

# totalFormatted
source: Total: {amount}
sr: Ukupno: {amount}

source: Select client for invoice
sr: Odaberite klijenta za fakturu

# addAtLeastOneItem
source: Add at least one item with price and quantity.
sr: Dodajte bar jednu stavku sa cenom i količinom.

# enterInvoiceNumberError
source: Enter invoice number.
sr: Unesite broj fakture.

source: Total amount
sr: Ukupan iznos

# autoCalculated
source: Automatically calculated based on items
sr: Automatski se računa na osnovu stavki

source: Enter amount greater than zero
sr: Unesite iznos veći od nule

source: Date
sr: Datum

source: Select date
sr: Izaberi datum

source: Note (optional)
sr: Napomena (opciono)

source: Search clients
sr: Pretraga klijenata

# noClientsForCriteria
source: No clients matching criteria.
sr: Nema klijenata za zadati kriterijum.

# invoiceItem
source: Item {index}
sr: Stavka {index}

source: Remove item
sr: Ukloni stavku

source: Item description
sr: Opis stavke

source: Enter item description
sr: Unesite opis stavke

source: Unit of measure
sr: Jedinica mere

source: Work hour
sr: Radni sat

source: Piece
sr: Komad

source: Quantity
sr: Količina

source: Enter quantity
sr: Unesite količinu

source: Price per unit
sr: Cena po jedinici

source: Enter price
sr: Unesite cenu

# itemAmount
source: Item amount: {total}
sr: Iznos stavke: {total}

source: Edit Client
sr: Izmena klijenta

source: Client name
sr: Naziv klijenta

source: Enter client name
sr: Unesite naziv klijenta

source: Actions
sr: Radnje

source: Print
sr: Štampa

source: PDF / Send
sr: PDF / Pošalji

# addClientBeforePrint
source: Add client before printing invoice.
sr: Dodajte klijenta pre štampe fakture.

# addClientBeforeSend
source: Add client before sending invoice.
sr: Dodajte klijenta pre slanja fakture.

# invoiceDetail
source: Invoice {number}
sr: Faktura {number}

# invoiceShareText
source: Invoice {invoiceNumber} for {clientName} amounts to {amount}. Payment to account: {accountNumber}.
sr: Faktura {invoiceNumber} za {clientName} iznosi {amount}. Uplata na račun: {accountNumber}.

# fabNewEntry
source: New Entry
sr: Nova stavka

# fabNewClient
source: New Client
sr: Novi klijent

# enterValue
source: Enter name
sr: Unesite naziv

# enterNumberGreaterOrEqualZero
source: Enter number greater than or equal to zero
sr: Unesite broj veći ili jednak nuli

# sheetInfo
source: Sheets: {expensesSheet} (expenses), {clientsSheet} (clients), {profileSheet} (profile)
sr: Sheetovi: {expensesSheet} (troškovi), {clientsSheet} (klijenti), {profileSheet} (profil)

source: Connected as {email}
sr: Povezano kao {email}
